** Left rotation problem

A left rotation operation on an array of size shifts each of the array's elements unit to the left. For example, if left rotations are performed on array , then the array would become .

Given an array of integers and a number, , perform left rotations on the array. Then print the updated array as a single line of space-separated integers.

Input Format

The first line contains two space-separated integers denoting the respective values of (the number of integers) and (the number of left rotations you must perform).
The second line contains space-separated integers describing the respective elements of the array's initial state.

Constraints

Output Format

Print a single line of space-separated integers denoting the final state of the array after performing left rotations.

Sample Input

5 4
1 2 3 4 5

Sample Output

5 1 2 3 4

Explanation

When we perform left rotations, the array undergoes the following sequence of changes:

Thus, we print the array's final state as a single line of space-separated values, which is 5 1 2 3 4.

#+BEGIN_SRC cpp :results output :tangle yes :tangle /tmp/cpphello.cpp
#include <iostream>
using namespace std;

int print_array(int a[], int size)
{
    for(int i=0; i < size - 1; i++)
    {
        cout << a[i]<<' ';
    }
    cout << a[size-1] << endl;
    return 0;
}

int rotate_array(int a[], int size)
{
    int a0 = a[0];
    for(int i=1; i<size; i++)
    {
        a[i-1] = a[i];
    }
    a[size-1] = a0;
    return 0;    
}

int rotate_n(int a[], int size, int num_rotate)
{
    for(int i=0;i<num_rotate;i++)
    {
        rotate_array(a, size);
    }
    return 0;
}

int main() 
{
    int size, num_rotate;
    cin >> size >> num_rotate;
    int a[size], tmp;
    for(int count=0; count<size; count++)
    {
        cin >> tmp;
        a[count] = tmp;
    }
    rotate_n(a, size, num_rotate);
    print_array(a, size);
    return 0;
}
#+END_SRC



#+BEGIN_SRC sh :results output
cd /tmp
g++ /tmp/cpphello.cpp
./a.out <<'EOF'
5 4
1 2 3 4 5
EOF

./a.out <<'EOF'
5 1
1 2 3 4 5
EOF
#+END_SRC

#+RESULTS:
: 5 1 2 3 4
: 2 3 4 5 1

#+BEGIN_SRC cpp :results output :tangle yes :tangle /tmp/cpp_rotate.cpp
#include <map>
#include <set>
#include <list>
#include <cmath>
#include <ctime>
#include <deque>
#include <queue>
#include <stack>
#include <string>
#include <bitset>
#include <cstdio>
#include <limits>
#include <vector>
#include <climits>
#include <cstring>
#include <cstdlib>
#include <fstream>
#include <numeric>
#include <sstream>
#include <iostream>
#include <algorithm>
#include <unordered_map>

using namespace std;


vector<int> array_left_rotation(vector<int> a, int size, int num_rotate) {
    int a0;
    for(int i=0;i<(num_rotate%size);i++)
    {
        a0 = a[0];
        for(int i=1; i<size; i++)
        {
            a[i-1] = a[i];
        }
        a[size-1] = a0;     
    }
    return a;    
}

int print_vector(vector<int> a, int size)
{
    for(int i = 0; i < size;i++)
        cout << a[i] << " ";
    cout << endl;
    return 0;
}

int main(){
    int n;
    int k;
    cin >> n >> k;
    vector<int> a(n);
    for(int a_i = 0;a_i < n;a_i++){
        cin >> a[a_i];
    }
    vector<int> output = array_left_rotation(a, n, k);
    print_vector(output, n);
    return 0;
}



#+END_SRC

#+RESULTS:


#+BEGIN_SRC sh :results output
cd /tmp
rm a.out
g++ -std=c++11 cpp_rotate.cpp
./a.out <<'EOF'
5 4
1 2 3 4 5
EOF
./a.out <<'EOF'
5 1
1 2 3 4 5
EOF
./a.out <<'EOF'
5 16
1 2 3 4 5
EOF
./a.out <<'EOF'
5 25
1 2 3 4 5
EOF
#+END_SRC

#+RESULTS:
: 5 1 2 3 4 
: 2 3 4 5 1 
: 2 3 4 5 1 
: 1 2 3 4 5 

k = 5
n = 4
a = 0 1 2 3 4

Taking pos = 2 and n = 4
n % k = 4 % 5 = 4 
Number of positions in he left of pos = 2 = 2
I need to move 2 positions to left 
move 1 position to extreme right
and 1 position again to left

How much should a position move?
actual_number_of_shifts = n % k
number_of_positions_in_left = pos - 0
if there are positions in the left 
    left_moves = (actual_number_of_shifts - number_of_positions_in_left)
    move left_moves to left
right_jump = (actual_number_of_shifts - left_moves) >= 1? 1 : 0
then do a right jump

remaining_left_moves = actual_number_of_shifts - (left_moves+right_jump)

#+BEGIN_SRC python :results output :tangle yes :tangle /tmp/left_rotate.py
def array_left_rotation(a, n, k):
    actual_number_of_shifts = n % k
    
    def get_moves(pos):
        number_of_positions_in_left = pos - 0
        if number_of_positions_in_left == 0:
            number_of_left_moves = 0
        else:
            if actual_number_of_shifts >= number_of_positions_in_left:
                number_of_left_moves = number_of_positions_in_left
            else:
                number_of_left_moves = actual_number_of_shifts
        if (actual_number_of_shifts - number_of_left_moves) > 0:
            right_jump = 1
        else:
            right_jump = 0
        remaining_left_moves = actual_number_of_shifts - (number_of_left_moves+right_jump)
        return number_of_left_moves, right_jump, remaining_left_moves
    b = range(k)
    for i in range(k):
        num_left, right_jump, rem_left = get_moves(i)
        if num_left == 0:
            if right_jump == 0:
                b[i] = a[i]
            else:
                j = k - 1 - rem_left 
                b[j] = a[i]
        else:
            if right_jump == 0:
                j = i - num_left
                b[j] = a[i]
            else:
                j = k - 1 - rem_left
                b[j] = a[i]
    return b
  

k, n = map(int, raw_input().strip().split(' '))
a = map(int, raw_input().strip().split(' '))
answer = array_left_rotation(a, n, k);
print ' '.join(map(str,answer))

#+END_SRC

#+RESULTS:
: 4
: 0 0 1 3
: 1 1 1 2
: 2 2 1 1
: 3 3 1 0
: 4 4 0 0

#+BEGIN_SRC sh :results output
cd /tmp
python left_rotate.py << 'eof'
5 4
1 2 3 4 5
eof
#+END_SRC

#+RESULTS:
: 5 1 2 3 4

** Number of characters to delete to get anagram

Alice is taking a cryptography class and finding anagrams to be very useful. We consider two strings to be anagrams of each other if the first string's letters can be rearranged to form the second string. In other words, both strings must contain the same exact letters in the same exact frequency For example, bacdc and dcbac are anagrams, but bacdc and dcbad are not.

Alice decides on an encryption scheme involving two large strings where encryption is dependent on the minimum number of character deletions required to make the two strings anagrams. Can you help her find this number?

Given two strings, and , that may or may not be of the same length, determine the minimum number of character deletions required to make and anagrams. Any characters can be deleted from either of the strings.


Input Format

The first line contains a single string, a.
The second line contains a single string, b.

Constraints
    1 <= |a|, |b| <= 10^4
    It is guaranteed that and consist of lowercase English alphabetic letters (i.e., a through z).

Output Format

Print a single integer denoting the number of characters you must delete to make the two strings anagrams of each other.

Sample Input

cde
abc

Sample Output

4

Explanation

We delete the following characters from our two strings to turn them into anagrams of each other:

    Remove d and e from cde to get c.
    Remove a and b from abc to get c.

We must delete characters to make both strings anagrams, so we print on a new line.


sort both a and b

iterate over a and b
select only common elements and delete the rest.

#+BEGIN_SRC cpp :results output :tangle yes :tangle /tmp/num_delete_to_anagram.cpp
#include <map>
#include <set>
#include <list>
#include <cmath>
#include <ctime>
#include <deque>
#include <queue>
#include <stack>
#include <string>
#include <bitset>
#include <cstdio>
#include <limits>
#include <vector>
#include <climits>
#include <cstring>
#include <cstdlib>
#include <fstream>
#include <numeric>
#include <sstream>
#include <iostream>
#include <algorithm>
#include <unordered_map>

using namespace std;

int number_needed(string a, string b) {
    sort(a.begin(), a.end());
    sort(b.begin(), b.end());
    cout << a << endl;
    cout << b << endl;
    a_l = a.length();
    return 0;   
}

int main(){
    string a;
    cin >> a;
    string b;
    cin >> b;
    cout << number_needed(a, b) << endl;
    return 0;
}
#+END_SRC

#+RESULTS:

#+BEGIN_SRC sh :results output
cd /tmp
rm ./a.out
g++ -std=c++11 num_delete_to_anagram.cpp
./a.out << 'EOF'
cde
abc
EOF

#+END_SRC

#+RESULTS:
: cde
: akr
: 0

** Check whether a given tree is binary search tree


#+BEGIN_SRC python :results output
# Node is defined as
class Node:
    def __init__(self, data):
        self.data = data
        self.left = None
        self.right = None

    def insert(self, num):
        node = Node(num)
        if num < self.data:
            if not self.left:
                self.left = node
            else:
                self.left.insert(num)
        else:
            if not self.right:
                self.right = node
            else:
                self.right.insert(num)

    def in_order(self):
        if self.left:
            self.left.in_order()
        print self.data
        if self.right:
            self.right.in_order()


def make_tree(lst):
    node = None
    for x in lst:
        if not node:
            node = Node(x)
        else:
            node.insert(x)
    return node

pos_inf = 10**8
neg_inf = -pos_inf

def check_BST(node):
    def check_bst(node):
        if not node:
            return True, neg_inf, pos_inf
        else:
            a1, high1, low1 = check_bst(node.left)
            a2, high2, low2 = check_bst(node.right)
            is_bst = a1 and a2 and node.data > high1 and node.data < low2
            a, b, c = is_bst, max(node.data, high1, high2), min(node.data, low1, low2)
            return a, b, c

    a, _, _ = check_bst(root)
    return a

    
tree = make_tree([4, 2, 6, 1, 3, 5, 7])
#tree.in_order()
print check_BST(tree)

nodes = [Node(i) for i in range(8)]
nodes[4].left = nodes[2]
nodes[4].right = nodes[6]
nodes[2].left = nodes[1]
nodes[2].right = nodes[3]
nodes[6].left = nodes[5]
nodes[6].right = nodes[7]
nodes[7].left = nodes[0]

#print check_BST(nodes[4])



#+END_SRC

#+BEGIN_SRC sh :results output
cd /tmp
python check_bst.py > test1.output << 'newdelim'
4 2 6 1 3 5 7
newdelim

cat > test1.output << 'newdelim'
Yes
newdelim

2>&1 diff test1.output test1.expected.output
true

#+END_SRC

#+RESULTS:
: 0a1
: > Yes


*** Cpp
#+BEGIN_SRC cpp
#include <map>
#include <set>
#include <list>
#include <cmath>
#include <ctime>
#include <deque>
#include <queue>
#include <stack>
#include <string>
#include <bitset>
#include <cstdio>
#include <limits>
#include <vector>
#include <climits>
#include <cstring>
#include <cstdlib>
#include <fstream>
#include <numeric>
#include <sstream>
#include <iostream>
#include <algorithm>
#include <unordered_map>

using namespace std;

bool is_balanced(string expression) {
  stack <char> stk;
  int length;
  char s, out_of_stack;
  length = expression.length();
  for(int i=0; i <= length; i++) {
    s = expression[i];
    if(s == '(' or s == '[' or s == '{') {
      stk.push(s);
    }
    else if(s == ')' or s == ']' or s == '}') {
      if(!stk.empty()){
	out_of_stack = stk.top();
	stk.pop();
      }else
      return false;
      if((out_of_stack == '(' && s == ')') || (out_of_stack == '[' && s == ']') || (out_of_stack == '{' && s == '}')){
	continue;
      }else
	return false;
	
    }
  }
  if(stk.empty()){
    return true;
  }
  else{
    return false;
  }
}

int main(){
    int t;
    cin >> t;
    for(int a0 = 0; a0 < t; a0++){
        string expression;
        cin >> expression;
        bool answer = is_balanced(expression);
        if(answer)
	  cout << "YES\n";
        else
	  cout << "NO\n";
    }
    return 0;
}

#+END_SRC

#+BEGIN_SRC sh :results output
cd /tmp
rm a.out
2>&1 g++ -std=c++11 matching_brackets.cpp
./a.out > test1.output <<'EOF'
5
{[()]}
{[(])}
{{[[(())]]}}
{]]
{{{[]}}
EOF
cat > test1.expected.output << 'eof'
YES
NO
YES
NO
NO
eof
diff test1.output test1.expected.output
true
cat test1.output
#+END_SRC

#+RESULTS:
: YES
: NO
: YES
: NO
: NO

** Tale of 2 stacks

#+BEGIN_SRC python :results output :tangle yes :tangle /tmp/tale_of_two_stacks.py

  empty_value = -5
  class Stack:
      def __init__(self, max_size=100):
          """ Initializes stack content to empty list """
          self.max_size = max_size
          self.data = [empty_value for i in range(self.max_size)]
          self.size = 0

      def push(self, value):
          """ Add an element to stack """
          self.data[self.size] = value
          self.size += 1

      def pop(self):
          """ Remove and return the element from the top of the stack """
          if self.size > 0:
              self.size -= 1
              data = self.data[self.size]
              return data
          else:
              return None

      def peek(self):
          """ Returns the top element of the stack but does not delete it """
          if self.size > 0:
              return self.data[self.size - 1]
          else:
              return None

      def is_empty(self):
          return self.size == 0

      def __str__(self):
          return ','.join([str(self.data[i]) for i in range(self.size)])


  class MyQueue(object):
      def __init__(self):
          self.stack1 = Stack(10**5 + 1)
          self.stack2 = Stack(10**5 + 1)
        
      def peek(self):
          if self.stack2.is_empty():
              while not self.stack1.is_empty():
                  value = self.stack1.pop()
                  self.stack2.push(value)
          value = self.stack2.peek()
          return value

            
      def pop(self):
          if self.stack2.is_empty():
              while not self.stack1.is_empty():
                  value = self.stack1.pop()
                  self.stack2.push(value)
          value = self.stack2.pop()
          return value
          
            
      def put(self, value):
          self.stack1.push(value)

  queue = MyQueue()
  t = int(raw_input())
  for line in range(t):
      values = map(int, raw_input().split())
      values = list(values)
      if values[0] == 1:
          queue.put(values[1])        
      elif values[0] == 2:
          queue.pop()
      else:
          print(queue.peek())

#+END_SRC

#+BEGIN_SRC sh :results output
cd /tmp
cat >input.txt << 'delim'
10
1 42
2
1 14
3
1 28
3
1 60
1 78
2
2
delim

cat > expected_output.txt << 'delim'
14
14
delim
python tale_of_two_stacks.py < input.txt > output.txt
diff -q expected_output.txt output.txt
echo $?
#+END_SRC

#+RESULTS:
: 0


*** Test min heap

#+BEGIN_SRC python :results output
  from heapq import heappush, heappop
  heap = []
  data = [1, 3, 5, 7, 9, 2, 4, 6, 8, 0]
  for item in data:
      heappush(heap, item)
  sort = []
  while heap:
      sort.append(heappop(heap))
  print sort


#+END_SRC

#+RESULTS:
: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

*** Code for testing this

#+BEGIN_SRC sh :results output
cd /tmp
cat > running_median.input << 'delim'
6
12
4
5
3
8
7
delim

cat > running_median.expected << 'delim'
12.0
8.0
5.0
4.5
5.0
6.0
delim

python running_median.py < running_median.input > running_median.output
diff -q running_median.expected running_median.output
echo $?
#+END_SRC

#+RESULTS:
: 0

** Trie contacts

back
baby
bail
bear
bent
cave
car
cap
cat
cow




#+BEGIN_SRC sh :results output
cd /tmp

cat > test1.input << 'newdelim'
4
add hack
add hackerrank
find hac
find hak
newdelim

python contacts.py < test1.input > test1.output

cat > test1.expected.output << 'newdelim'

0
newdelim

2>&1 diff test1.output test1.expected.output
true

#+END_SRC

#+RESULTS:
: 0a1,2
: > 2
: > 0

*** Testing
#+BEGIN_SRC sh :results output

cd /tmp
cat > count_inversions.input << 'delim'
2  
5  
1 1 1 2 2  
5  
2 1 3 1 2
delim

cat > count_inversions.expected << 'delim'
0
4
delim

python count_inversions.py < count_inversions.input > count_inversions.output
diff -q count_inversions.expected count_inversions.output
echo $?

g++ count_inversions.cpp
./a.out count_inversions.py < count_inversions.input > count_inversions.output
diff -q count_inversions.expected count_inversions.output
echo $?

#+END_SRC

#+RESULTS:
: 0
: 0


